Tekla.Structures.Catalogs.ShapeMetadataTypeEnum
Represents data type or measurement unit of the specific metadata
If this is updated, update ShapeMetadataType_e on the Core side

Tekla.Structures.Catalogs.ShapeMetadataTypeEnum.Text
Default value is text

Tekla.Structures.Catalogs.ShapeMetadataTypeEnum.DateTime
Date

Tekla.Structures.Catalogs.ShapeMetadataTypeEnum.Integer
Integer

Tekla.Structures.Catalogs.ShapeMetadataTypeEnum.Double
Double, here precision controlled by TS-> Menu-> Settings-> Options-> Units and decimals -> Modeling -> Factor
"XS_UNITDECIMALS_INPUT_FACTOR"

Tekla.Structures.Catalogs.ShapeMetadataTypeEnum.Length
Unit of length, here length refers to TS-> Menu-> Settings-> Options-> Units and decimals -> Catalogs -> Dimension.
"XS_UNIT_INPUT_DIMENSION", "XS_UNITDECIMALS_INPUT_DIMENSION"

Tekla.Structures.Catalogs.ShapeMetadataTypeEnum.Area
Unit of area, here area refers to TS-> Menu-> Settings-> Options-> Units and decimals -> Catalogs -> Area.
"XS_UNIT_INPUT_AREA", "XS_UNITDECIMALS_INPUT_AREA"

Tekla.Structures.Catalogs.ShapeMetadataTypeEnum.Volume
Unit of volume, here volume refers to TS-> Menu-> Settings-> Options-> Units and decimals -> Catalogs -> Volume.
"XS_UNIT_INPUT_VOLUME", "XS_UNITDECIMALS_INPUT_VOLUME"

Tekla.Structures.Catalogs.ShapeMetadataTypeEnum.Weight
Unit of weight, here weight refers to TS-> Menu-> Settings-> Options-> Units and decimals -> Catalogs -> Weight.
"XS_UNIT_INPUT_WEIGHT", "XS_UNITDECIMALS_INPUT_WEIGHT"